<?php
// +----------------------------------------------------------------------
// | 自定义路由
// +----------------------------------------------------------------------
// | Copyright (c) 2019 http://www.jeoshi.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: kevin
// +----------------------------------------------------------------------

return [
    //别名配置,别名只能是映射到控制器且访问时必须加上请求的方法
    '__alias__'   => [
    ],
    //变量规则
    '__pattern__' => [
    ],
    // 登录
    'login' => 'v1/login/index',
    // 退出
    'logout' => 'v1/login/logout',
    // 锁屏
    'locks' => 'v1/login/locks',
];
