<?php
// +----------------------------------------------------------------------
// | 自定义配置
// +----------------------------------------------------------------------
// | Copyright (c) 2019 http://www.jeoshi.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: kevin
// +----------------------------------------------------------------------

return [
    // ERP页面跳转
    'erpdomain' => 'http://erp.spocoo.com/t.php?s=/Home/Main',
    // 系统ID
    'system_id' => 1,
    // 每页显示记录
    'pagesize' => 20,
    // 配置分组
    'configgroup' => ['basic' => '基础配置', 'notice' => '通知管理', 'dictionary' => '字典配置'],
];