<?php
// +----------------------------------------------------------------------
// | url配置
// +----------------------------------------------------------------------
// | Copyright (c) 2019 http://www.jeoshi.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: kevin
// +----------------------------------------------------------------------

return [
    // 登录
    'login' => '/login',
    // 退出
    'logout' => '/logout',
    // 锁屏
    'locks' => '/locks',
    // 个人资料
    'profile' => '/v1/index/profile',
    // 个人设置
    'setting' => '/v1/index/setting',
    // 刷新权限
    'cleanup' => '/v1/index/cleanup',
];
